FranciscoCasado/wesstlab-biomonitor/tirtos_cc13xx_cc26xx_2_20_01_08/products/tidrivers_cc13xx_cc26xx_2_20_01_10/packages/ti/drivers/sdspi/SDSPICC26XX.c
/*
 * Copyright (c) 2015, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*-----------------------------------------------------------------------*/
/* MMC/SDC (in SPI mode) control module  (C)ChaN, 2007                   */
/*-----------------------------------------------------------------------*/

#include <stdint.h>
#include <stdbool.h>

#include <xdc/runtime/Assert.h>
#include <xdc/runtime/Diags.h>
#include <xdc/runtime/Log.h>
#include <xdc/runtime/Types.h>
#include <xdc/runtime/Timestamp.h>
#include <xdc/runtime/System.h>

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

#include "SDSPICC26XX.h"
#include <ti/drivers/pin/PINCC26XX.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

/* driverlib header files */
#include <inc/hw_memmap.h>
#include <inc/hw_types.h>
#include <inc/hw_ints.h>
#include <driverlib/ssi.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/ioc.h>
#include <driverlib/prcm.h>
#include <driverlib/rom.h>
#include "Board.h"
/* Definitions for MMC/SDC command */
#define CMD0                        (0x40+0)    /* GO_IDLE_STATE */
#define CMD1                        (0x40+1)    /* SEND_OP_COND */
#define CMD8                        (0x40+8)    /* SEND_IF_COND */
#define CMD9                        (0x40+9)    /* SEND_CSD */
#define CMD10                       (0x40+10)   /* SEND_CID */
#define CMD12                       (0x40+12)   /* STOP_TRANSMISSION */
#define CMD16                       (0x40+16)   /* SET_BLOCKLEN */
#define CMD17                       (0x40+17)   /* READ_SINGLE_BLOCK */
#define CMD18                       (0x40+18)   /* READ_MULTIPLE_BLOCK */
#define CMD23                       (0x40+23)   /* SET_BLOCK_COUNT */
#define CMD24                       (0x40+24)   /* WRITE_BLOCK */
#define CMD25                       (0x40+25)   /* WRITE_MULTIPLE_BLOCK */
#define CMD41                       (0x40+41)   /* SEND_OP_COND (ACMD) */
#define CMD55                       (0x40+55)   /* APP_CMD */
#define CMD58                       (0x40+58)   /* READ_OCR */

#define SD_SECTOR_SIZE              512

#define START_BLOCK_TOKEN           0xFE
#define START_MULTIBLOCK_TOKEN      0xFC
#define STOP_MULTIBLOCK_TOKEN       0xFD

#define DRIVE_NOT_MOUNTED           ~0

/*
 * Array of SDSPI_Handles to determine the association of the FatFs drive number
 * with a SDSPI_Handle
 * _VOLUMES is defined in <ti/mw/fatfs/ffconf.h>
 */
static SDSPI_Handle sdspiHandles[_VOLUMES];

/* ms scaling to function timeouts */
static uint32_t mSScalingFactor = 0;

/* Function prototypes */
static uint32_t       rcvr_datablock(SDSPICC26XX_HWAttrs const *hwAttrs,
                                     uint8_t *buf, uint32_t btr);
static inline void    releaseSPIBus(SDSPICC26XX_HWAttrs const *hwAttrs);
static inline uint8_t rxSPI(SDSPICC26XX_HWAttrs const *hwAttrs);
static uint8_t        send_cmd(SDSPICC26XX_HWAttrs const *hwAttrs, uint8_t cmd,
                               uint32_t arg);
static void           send_initial_clock_train(SDSPICC26XX_HWAttrs const *hwAttrs);
static inline void    takeSPIBus(SDSPICC26XX_HWAttrs const *hwAttrs);
static inline void    txSPI(SDSPICC26XX_HWAttrs const *hwAttrs, uint8_t dat);
static uint8_t        wait_ready(SDSPICC26XX_HWAttrs const *hwAttrs);
static bool           xmit_datablock(SDSPICC26XX_HWAttrs const *hwAttrs,
                                     const uint8_t *buf, uint8_t token);

/* FatFs disk I/O functions */
DSTATUS  SDSPICC26XX_diskInitialize(BYTE drv);
DRESULT  SDSPICC26XX_diskIOctrl(BYTE drv, BYTE ctrl, void *buf);
DRESULT  SDSPICC26XX_diskRead(BYTE drv, BYTE *buf,
                            DWORD sector, UINT count);
DSTATUS  SDSPICC26XX_diskStatus(BYTE drv);
DRESULT  SDSPICC26XX_diskWrite(BYTE drv, const BYTE *buf,
                             DWORD sector, UINT count);

/* SDSPICC26XX functions */
void         SDSPICC26XX_close(SDSPI_Handle handle);
int          SDSPICC26XX_control(SDSPI_Handle handle, unsigned int cmd, void *arg);
void         SDSPICC26XX_init(SDSPI_Handle handle);
SDSPI_Handle SDSPICC26XX_open(SDSPI_Handle handle, unsigned char drv,
                            SDSPI_Params *params);

/* SDSPI function table for SDSPICC26XX implementation */
const SDSPI_FxnTable SDSPICC26XX_fxnTable = {
    SDSPICC26XX_init,
    SDSPICC26XX_open,
    SDSPICC26XX_close,
    SDSPICC26XX_control
};

/* Default SDSPI params */
extern const SDSPI_Params SDSPI_defaultParams;
extern PIN_Handle ledPinHandle; // TODO: where does this handle come from???

