FranciscoCasado/wesstlab-biomonitor/tirtos_cc13xx_cc26xx_2_20_01_08/products/tidrivers_cc13xx_cc26xx_2_20_01_10/packages/ti/drivers/sdspi/SDSPICC26XX.c
/*
 *  ======== rcvr_datablock ========
 *  Function to receive a block of data from the SDCard
 *
 *  btr count must be an even number
 */
static uint32_t rcvr_datablock(SDSPICC26XX_HWAttrs const *hwAttrs,
                               uint8_t *buf, uint32_t btr)
{
    uint8_t   token;
    uint32_t  timestampTimeout;
    uint32_t  timestampStart;
    uint32_t  timestampCurrent;

    /* Wait for data packet in timeout of 100 ms */
    timestampStart = Timestamp_get32();
    timestampTimeout = timestampStart + 100 * mSScalingFactor;
    if (timestampTimeout > timestampStart) {
        timestampStart = ~0;
    }
    do {
        token = rxSPI(hwAttrs);
        timestampCurrent = Timestamp_get32();
    } while ((token == 0xFF) && ((timestampCurrent <= timestampTimeout) ||
                                 (timestampCurrent >= timestampStart)));

    if (token != START_BLOCK_TOKEN) {
        /* If not valid data token, return error */
        return (0);
    }

    /* Receive the data block into buffer */
    do {
        *(buf++) = rxSPI(hwAttrs);
    } while (--btr);

    /* Read the CRC, but discard it */
    rxSPI(hwAttrs);
    rxSPI(hwAttrs);

    /* Return with success */
    return (1);
}

/*
 *  ======== releaseSPIBus ========
 *  Function to release the SPI bus
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 */
static inline void releaseSPIBus(SDSPICC26XX_HWAttrs const *hwAttrs)
{
    /* Deselect the SD card. */
    IOCPinTypeGpioOutput( hwAttrs->pinCS);
    PIN_setOutputValue(ledPinHandle, hwAttrs->pinCS, 1);
    //GPIOPinWrite(hwAttrs->portCS, hwAttrs->pinCS, hwAttrs->pinCS);
}

/*
 *  ======== rxSPI ========
 *  Function to receive one byte onto the SPI bus. Polling (Blocked)
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 */
static inline uint8_t rxSPI(SDSPICC26XX_HWAttrs const *hwAttrs)
{
    SDSPIDataType   rcvdat;

    /* write dummy data */
    SSIDataPut(hwAttrs->baseAddr, 0xFF);

    /* read data frm rx fifo */
    SSIDataGet(hwAttrs->baseAddr, (void *)&rcvdat);

    return ((uint8_t)rcvdat);
}

/*
 *  ======== send_cmd ========
 *  Function that will transmit an command to the SDCard
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 *
 *  @param  cmd         SD command
 *
 *  @param  arg         SD command argument
 */
static uint8_t send_cmd(SDSPICC26XX_HWAttrs const *hwAttrs, uint8_t cmd, uint32_t arg)
{
    uint8_t n;
    uint8_t res;

    if (wait_ready(hwAttrs) != 0xFF) {
        Log_print1(Diags_USER1, "SDSPI:(%p) send_cmd: SD card wait time expired",
                                 hwAttrs->baseAddr);
        return (0xFF);
    }

    /* Send command packet */
    txSPI(hwAttrs, cmd);                    /* Command */
    txSPI(hwAttrs, (uint8_t)(arg >> 24));   /* Argument[31..24] */
    txSPI(hwAttrs, (uint8_t)(arg >> 16));   /* Argument[23..16] */
    txSPI(hwAttrs, (uint8_t)(arg >> 8));    /* Argument[15..8] */
    txSPI(hwAttrs, (uint8_t)arg);           /* Argument[7..0] */

    if (cmd == CMD0) {
        /* CRC for CMD0(0) */
        n = 0x95;
    }
    else if (cmd == CMD8) {
        /* CRC for CMD8(0x1AA) */
        n = 0x87;
    }
    else {
        /* Default CRC should be at least 0x01 */
        n = 0x01;
    }

    /* Future enhancement to add CRC support */
    txSPI(hwAttrs, n);

    /* Receive command response */
    if (cmd == CMD12) {
        /* Skip a stuff byte when stop reading */
        rxSPI(hwAttrs);
    }

    /* Wait for a valid response in timeout; 10 attempts */
    n = 10; //TODO: Check if this parameter is enough (reference is 80)
    do {
        res = rxSPI(hwAttrs);
    } while ((res & 0x80) && --n);

    /* Return with the response value */
    return (res);
}

/*
 *  ======== send_initial_clock_train ========
 *  Function to get the SDCard into SPI mode
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 */
static void send_initial_clock_train(SDSPICC26XX_HWAttrs const *hwAttrs)
{
    unsigned char   i;
    SDSPIDataType   dat;

    /* Deselect the SD card. */
    PIN_setOutputValue(ledPinHandle, hwAttrs->pinCS, 1);

    /* Switch the SPI TX line to a GPIO and drive it high too. */
    IOCPinTypeGpioOutput( hwAttrs->pinMOSI);//????
    PIN_setOutputValue(ledPinHandle, hwAttrs->pinMOSI, 1);

    /*
     * Send 10 bytes over the SPI bus. This causes the clock to toggle several
     * times to get the SD Card into SPI mode.
     */
    for (i = 0; i < 10; i++) {
        /*
         * Write DUMMY data. SSIDataPut() waits until there is room in the
         * FIFO.
         */
        SSIDataPut(hwAttrs->baseAddr, 0xFF);

        /* Flush data read during data write. */
        SSIDataGet(hwAttrs->baseAddr, (void*)&dat);
        //rxSPI(hwAttrs);
    }

    /* Revert to hardware control of the SPI TX line. */
    IOCPinTypeSsiMaster(hwAttrs->baseAddr,hwAttrs->pinMISO,hwAttrs->pinMOSI,hwAttrs->pinCS, hwAttrs->pinSCK);  //???

    Log_print1(Diags_USER1, "SDSPI:(%p) initialized SD card to SPI mode",
                             hwAttrs->baseAddr);
}

/*
 *  ======== takeSPIBus ========
 *  Function to take the SPI bus
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 */
static inline void takeSPIBus(SDSPICC26XX_HWAttrs const *hwAttrs)
{
    /* Select the SD card. */
    IOCPinTypeGpioOutput( hwAttrs->pinCS);
    PIN_setOutputValue(ledPinHandle, hwAttrs->pinCS, 0);
    }

/*
 *  ======== txSPI ========
 *  Function to transmit one byte onto the SPI bus. Polling (Blocked)
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 *
 *  @param  dat         Data to be sent onto the SPI bus
 */
static inline void txSPI(SDSPICC26XX_HWAttrs const *hwAttrs, uint8_t dat)
{
    SDSPIDataType   rcvdat;

    /* Write the data to the tx fifo */
    SSIDataPut(hwAttrs->baseAddr, dat);

    /* flush data read during the write */
    SSIDataGet(hwAttrs->baseAddr, (void*)&rcvdat);
}

/*
 *  ======== wait_ready ========
 *  Function to check if the SDCard is busy
 *
 *  This function queries the SDCard to see if it is in a busy state or ready
 *  state
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 */
static uint8_t wait_ready(SDSPICC26XX_HWAttrs const *hwAttrs)
{
    uint8_t   res;
    uint32_t  timestampTimeout;
    uint32_t  timestampStart;
    uint32_t  timestampCurrent;

    /* Wait for data packet in timeout of 500 ms */
    timestampStart = Timestamp_get32();
    timestampTimeout = timestampStart + 500 * mSScalingFactor;
    if (timestampTimeout > timestampStart) {
        timestampStart = ~0;
    }
    rxSPI(hwAttrs);
    do {
        res = rxSPI(hwAttrs);
        timestampCurrent = Timestamp_get32();
    } while ((res != 0xFF) && ((timestampCurrent <= timestampTimeout) ||
                               (timestampCurrent >= timestampStart)));

    return (res);
}

/* _READONLY is defined in <ti/mw/fatfs/diskio.h> */
#if _READONLY == 0
/*
 *  ======== xmit_datablock ========
 *  Function to transmit a block of data to the SDCard
 *
 *  @param  hwAttrs     Pointer to hardware attributes
 *
 *  @param  params      SDSPICC26XX hardware attributes
 *
 *  @param  buf         pointer to const data buffer
 *
 *  @param  token       command token to be sent to the SD card prior to
 *                      sending the data block. The available tokens are:
 *                      START_BLOCK_TOKEN
 *                      START_MULTIBLOCK_TOKEN
 *                      STOP_MULTIBLOCK_TOKEN
 */
static bool xmit_datablock(SDSPICC26XX_HWAttrs const *hwAttrs,
                           const uint8_t *buf, uint8_t token)
{
    uint8_t resp;
    uint8_t wc;

    if (wait_ready(hwAttrs) != 0xFF) {
        /* Return with error */
        return (false);
    }

    /* Xmit data token */
    txSPI(hwAttrs, token);

    /* Send data only when token != STOP_MULTIBLOCK_TOKEN */
    if (token != STOP_MULTIBLOCK_TOKEN) {
        /* Is data token */
        wc = 0;
        /* Transferring 512 byte blocks using a 8 bit counter */
        do {
            /* Xmit the SD_SECTOR_SIZE byte data block */
            txSPI(hwAttrs, *buf++);
            txSPI(hwAttrs, *buf++);
        } while (--wc);

        /* Future enhancement to add CRC support */
        txSPI(hwAttrs, 0xFF);
        txSPI(hwAttrs, 0xFF);

        /* Reveive data response */
        resp = rxSPI(hwAttrs);

        /* If not accepted, return error */
        if ((resp & 0x1F) != 0x05) {
            return (false);
        }
    }

    /* Return with success */
    return (true);
}
#endif /* _READONLY */

